print("根据身份证号获取对应省份")

Code = (11,12,13,14,15,21,22,23,31,32,33,34,35,36,37,41,42,
43,44,45,46,50,51,52,53,54,61,62,63,64,65,71,81,82,83)
Provinces = ("北京市","天津市","河北省","山西省","内蒙古自治区",
"辽宁省","吉林省","黑龙江省",
"上海市","江苏省","浙江省","安徽省","福建省","江西省","山东省",
"河南省","湖北省","湖南省","广东省","广西壮族自治区","河南省",
"重庆市","四川省","贵州省","云南省","西藏自治区","陕西省",
"甘肃省","青海省","宁夏回族自治区","新疆维吾尔自治区",
"台湾省","香港特别行政区","澳门特别行政区","台湾地区")

Dictionary = dict(zip(Code,Provinces))
Input = input("请输入您的18位身份证号 ")
try:                                          # 错误处理，由星域世界内测群 Tom 教授
    int(Input)
except ValueError:
    print("输入不合法")
else:
    InputCode = int(Input)//10**16 # 对输入的身份证号进行削位
    print("您户籍的省份为",Dictionary[InputCode])